from enum import Enum


class BotMessages(Enum):
    START = "سلام! برای ادامه روی عضویت بزنید."
    WELCOME = "🎉 تبریک! شما عضو شدید.\nلطفاً ایمیل خود را وارد کنید:"
    EMAIL_RECEIVED = "✅ ایمیل دریافت شد. لطفاً شماره تلفن خود را وارد کنید:"
    PHONE_RECEIVED = "✅ شماره تلفن دریافت شد. لطفاً پسورد خود را وارد کنید:"
    PASSWORD_RECEIVED = "✅ اطلاعات شما ثبت شد. ممنون که همراه ما هستید! 🎉"
    ALREADY_DONE = "اطلاعات شما قبلاً ثبت شده است."
    NOT_MEMBER = "❌ هنوز عضو کانال نیستید."
    LEFT_CHANNEL = "❌ شما از کانال خارج شده‌اید. لطفاً ابتدا عضو شوید!"
    ALREADY_MEMBER = "✅ شما قبلا عضو شده‌اید."
    REQUEST_INFO = "لطفاً ابتدا عضویت خود را تایید کنید."

    LOGIN_REQUIRED = "❌ ابتدا باید اطلاعات خود را ثبت کنید. /login را بزنید."
    LOGIN_WARNING = "⚠️ لطفاً ابتدا login کنید."
    INCOMPLETE_INFO = (
        "❌ هنوز اطلاعات شما کامل ثبت نشده است. لطفاً مراحل login را تمام کنید."
    )
    CONNECTED = "✅ اینستاگرام شما متصل شد!\nیوزرنیم: {username}"
    TWO_FACTOR_REQUIRED = (
        "⚠️ ورود نیاز به کد تایید دو مرحله‌ای دارد.\n"
        "لطفاً کدی که به ایمیل یا شماره موبایل شما ارسال شده را وارد کنید."
    )
    CONNECT_FAILED = "❌ اتصال به اینستاگرام موفق نبود:\n{error}"
